// Перебирающие методы массивов в js
// Функции высшего порядка – которые вызывают внутри себя callback-функции

// forEach – метод перебора массива.


// filter метод возвращает элементы массива, для которых условие истинно.
// Отсеивание элементов по определенном критерию.


// map - преобразовать каждый элемент


// every, some – отсеять по определенному критерию, возвращает boolean.
// Функции предикаты – возвращают буленовские значения.

// reduce (сокращать) - метод, который позволяет что-то вычислять
// и между вычислениями сохранять какое-то промежуточное значение.